Revit 2027 API
ParameterTypeId.RebarShape Property
 "Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShape { get; }
Public Shared ReadOnly Property RebarShape As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShape {
	ForgeTypeId^ get ();
}
static member RebarShape : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace